[
{"hotel_id": 120725, "comment_id": "8108449303517", "trip_type": "family", "locale": "id", "rating": "10.0", "title": "👍", "text": "Nice room, nice restaurants, nice location, friendly and helpful staff", "time": {"comment": "2018/07/31"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8136425078479", "trip_type": "with-friends", "locale": "hk", "rating": "10.0", "title": "Comfy stay~", "text": "Very comfortable hotel with friendly staff. Nice hot area with hot tub and well equipped gym.", "time": {"comment": "2018/06/29"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8146809136340", "trip_type": "with-friends", "locale": "ph", "rating": "10.0", "title": "All good", "text": "Great location, good service, good gym - and great restaurants", "time": {"comment": "2018/06/23"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8149077905075", "trip_type": "business", "locale": "gb", "rating": "10.0", "title": "Perfect business stay", "text": "Fantastic overall as usual. Only unexpected observation was the below standard bed making - sheets not properly pulled, not tucked in etc.", "time": {"comment": "2018/06/17"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8126499294989", "trip_type": "romance", "locale": "th", "rating": "10.0", "title": "Short Holiday In Taipei", "text": "Location was excellent, near Taipei 101, many shopping malls and shops, as well as many types of restaurants etc.  The room could have been a little bigger, unusually small for a Hyatt room, plus the room could use more lighting at the desk, a little too dark, as well as a mirror at the desk (there was a large LED TV instead).  The only mirror outside the bathroom was near the door but the hair dryer plug did not reach.", "time": {"comment": "2018/06/18"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8136987486567", "trip_type": "romance", "locale": "il", "rating": "10.0", "title": "True 5 Star hotel in Heart of Taipei", "text": "Grand Hyatt Taipei, is a great hotel, extremely well located in the heart of the city. It is just 3 - 4 minutes from Taipei 101 and also from the MRT station. Also, the airport shuttle bus stops right in front of the hotel. The hotel true to the hotel rating is huge, with 5 star facilities. The Gym and the spa are great but did not much like to swimming pool which was average to say the least. While everything about the hotel is great but we just felt that it was a bit cold and contrary to everyone in Taipei being so warm, the staff were professional but not warm and friendly. As I stay in many places around the world, I could compare and more so I felt everyone in Taipei is extra warm and friendly but in Grand Hyatt Taipei, the staff may need some orientation on this aspect. ", "time": {"comment": "2018/06/12"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8123795405614", "trip_type": "family", "locale": "hk", "rating": "10.0", "title": "Nice hotel", "text": "It was great place and breakfast was good.\r\n\r\nDeposit return is quite late and it took 3 weeks but not yet canceled. other than this issue, everything was good", "time": {"comment": "2018/05/12"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8114385884016", "trip_type": "with-friends", "locale": "sg", "rating": "10.0", "title": "", "text": "Friendly staff ∼ comfortable bed", "time": {"comment": "2018/05/25"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8111966444314", "trip_type": "with-friends", "locale": "hk", "rating": "6.0", "title": "", "text": "I gave my comment to the hotel upon my departure", "time": {"comment": "2018/05/24"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8139440772203", "trip_type": "business", "locale": "us", "rating": "10.0", "title": "Amazing", "text": "in one word, amazing", "time": {"comment": "2018/05/06"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8144072150273", "trip_type": "family", "locale": "ph", "rating": "4.0", "title": "Very Slow Check-In Process", "text": "Check-in was slow. They made us wait for an hour. If I did not notify the hotel that I was with my 85-year-old mother, they would have just let us wait at the lobby for one more hour. Two hours of waiting is too much, and that means two hours taken off from one day of our stay, considering that the rooms are priced above average. I also had a hard time booking a table for two at their buffet restaurant (Cafe). However, when I told the Reservations Officer that we were able to book a table in buffet restaurant another 5-Star hotel, they suddenly found a table for us. And that was weird. If not for the close up window view of the Taipei 101, I would not recommend this hotel to my relatives and friends at all. Well, at least this hotel has something to boast of, and that is the view of the Taipei 101. ", "time": {"comment": "2018/05/08"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8153369085044", "trip_type": "family", "locale": "us", "rating": "8.0", "title": "", "text": "Normal high-end hotel.", "time": {"comment": "2018/04/05"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8111596113683", "trip_type": "family", "locale": "ph", "rating": "10.0", "title": "Family vacation to Taipei", "text": "Location is fantastic as right across the street from Taipei 101 and the district is nice and clean. Taipei 101 has the MRT station which can take you anywhere in Taipei. Taipei 101 also has a Ding Tai Fung, so its perfect start to the trip. Staff is very nice and helpful and breakfast buffet is great. Overall a perfect place for vacation or business stay in Taipei. ", "time": {"comment": "2018/04/03"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8079949242239", "trip_type": "romance", "locale": "us", "rating": "10.0", "title": "", "text": "We had a great time at Grand Hyatt Taipei. It is located right next  to the iconic 101 Tower and just 5 minutes from the subway. I have always been impressed with Hyatt chain and have stayed with them for many years previously. The high quality of their service and amenities have been consistent all these years. Their beds, bed linen and bath towels are superbly comfortable and plush. \r\nThe Grand Hyatt Taipei is one of their best examples. The design and quality of the hotel building are outstanding. I like in particular their color scheme which is a pleasing combination of beige and brown. This seems to be the Hyatt theme. Very soothing after a long flight or day. \r\nThe service was outstanding. We were checked in (by Shelley) in less than 3 minutes. That's fantastic service. She was  very professional and friendly. \r\nThe bell service sent up our bags very fast as well. \r\nThe room has full amenities. I would like to mention that info addition to the usual , the room had rain shower and an Elly coffee machine. Very well appointed. \r\nThere is a number of good restaurants in the hotel. The irodori Japanese restaurant is recommended. \r\nWe had a wonderful stay. Will be back", "time": {"comment": "2018/02/23"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8061824095747", "trip_type": "romance", "locale": "sg", "rating": "10.0", "title": "Excellent ", "text": "Comfortable room, friendly staff and convenient location.", "time": {"comment": "2018/02/07"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8066672162468", "trip_type": "business", "locale": "sg", "rating": "10.0", "title": "Lovely short stay", "text": "One-night stay made memorable by the impeccable service and the complimentary upgrade to an executive suite. The location is  great if you’re into shopping, but if you’re not into that, the hotel is close to two subway stations and there’s plenty of taxis to get you to places. Croissants at the ground floor baguette taste wonderful.", "time": {"comment": "2018/01/24"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8087139287506", "trip_type": "family", "locale": "kr", "rating": "10.0", "title": "Good for family trip", "text": "The hotel lives up to its name. 3 of us stayed in one room, and the sofa bed they provided was actually pretty comfortable. They placed it right next to the window so it was a bit chilly at night, but it was at a level I could definitely live with. It is literally 3 minutes away from Taipei 101, and we could see it right outside the window. Transportation was therefore convenient, breakfast selection was wide and delicious, and their free sauna was a godsend after each day of constant walking. Will definitely be back! ", "time": {"comment": "2017/12/01"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8098126683535", "trip_type": "family", "locale": "au", "rating": "10.0", "title": "", "text": "It was raining in Taipei  during our 3 nights stay. The hotel is linked to the 101 tower and huge modern shopping complex so we were dry to dine and shop ", "time": {"comment": "2018/01/05"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8062799763685", "trip_type": "family", "locale": "ca", "rating": "10.0", "title": "Great hotel ", "text": "Very comfortable, convenient and accommodating hotel. Front desk staffs are very friendly and concierge was very helpful. They accommodated my extra bed and late checkout with no extra charges. \r\n\r\nThe 101 mall and MTR was just round the corner.  I will definitely recommend this hotel! ", "time": {"comment": "2018/01/04"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8071277160712", "trip_type": "business", "locale": "au", "rating": "10.0", "title": "Great hotel at an unbeatble location", "text": "Very enjoyable stay. Room is spacious for its location. Location is great and close to MTR station. Staff are all friendly. ", "time": {"comment": "2018/01/04"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8085965063226", "trip_type": "family", "locale": "ph", "rating": "8.0", "title": "Nice staff", "text": "Attentive , warm staff. Perfect location", "time": {"comment": "2017/12/29"}, "labels": {}},
{"hotel_id": 120725, "comment_id": "8091380497395", "trip_type": "with-friends", "locale": "us", "rating": "8.0", "title": "Facility", "text": "Great sauna facility", "time": {"comment": "2017/12/25"}, "labels": {}}
]